package Day11.interDemo01;
/*
1.私有化实例变量
2.set和get
3.构造器
========================
把以下的这些内容，还要向上抽取，专门给其放到接口
4.抽象方法
5.不需要重写的实例方法
6.静态方法
7.私有方法
8.自定义常量

接口的理解：所谓接口就是储存一定数据标准和方法的集合
接口的格式：修饰符 interface 接口名字{
            自定义常量
            抽象方法
            默认方法
            静态方法
            私有方法

            修饰符 class 实现类名 extends 父类类名 implements接口1，接口2，接口3.....

            implements实现：
                可以理解为继承，因为实现关系和继承关系90%都是一致的，重点的是10%不同的
























}
 */
public class interfaceDemo1 {
}
